Revit 2026 API

# PartUtilsDivideParts Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static PartMaker DivideParts(
	Document document,
	ICollection<ElementId> elementIdsToDivide,
	ICollection<ElementId> intersectingReferenceIds,
	IList<Curve> curveArray,
	ElementId sketchPlaneId
)
```
```vb
Public Shared Function DivideParts (
	document As Document,
	elementIdsToDivide As ICollection(Of ElementId),
	intersectingReferenceIds As ICollection(Of ElementId),
	curveArray As IList(Of Curve),
	sketchPlaneId As ElementId
) As PartMaker
```
```cpp
public:
static PartMaker^ DivideParts(
	Document^ document,
	ICollection<ElementId^>^ elementIdsToDivide,
	ICollection<ElementId^>^ intersectingReferenceIds,
	IList<Curve^>^ curveArray,
	ElementId^ sketchPlaneId
)
```
```fsharp
static member DivideParts :
        document : Document *
        elementIdsToDivide : ICollection<ElementId> *
        intersectingReferenceIds : ICollection<ElementId> *
        curveArray : IList<Curve> *
        sketchPlaneId : ElementId -> PartMaker
```

#### Parameters

document Document

elementIdsToDivide ICollectionElementId

intersectingReferenceIds ICollectionElementId

curveArray IListCurve

sketchPlaneId ElementId

#### Return Value

PartMaker

#### Reference

PartUtils Class

Autodesk.Revit.DB Namespace